{"keras_version": "2.2.0", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 31], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcx0AAAB8AABkAABkAACFAgBkAQBkAABkAACFAgBmAwAZUykC\nTukAAAAAqQApAdoBeHICAAAAcgIAAAD6GHRlc3RfdGVzdF9maW5pc2hlZF9uaS5wedoIPGxhbWJk\nYT55AAAAcwAAAAA=\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcx0AAAB8AABkAABkAACFAgBkAQBkAABkAACFAgBmAwAZUykC\nTukBAAAAqQApAdoBeHICAAAAcgIAAAD6GHRlc3RfdGVzdF9maW5pc2hlZF9uaS5wedoIPGxhbWJk\nYT5/AAAAcwAAAAA=\n", null, null], "name": "lambda_2", "output_shape_type": "raw", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcx0AAAB8AABkAABkAACFAgBkAQBkAABkAACFAgBmAwAZUykC\nTukCAAAAqQApAdoBeHICAAAAcgIAAAD6GHRlc3RfdGVzdF9maW5pc2hlZF9uaS5wedoIPGxhbWJk\nYT6DAAAAcwAAAAA=\n", null, null], "name": "lambda_3", "output_shape_type": "raw", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 30, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 1, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 2, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["activation_2", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 200, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 200, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_constraint": null, "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 182, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [13, 7, 2], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "softmax_1", "class_name": "Softmax", "config": {"name": "softmax_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "output_layers": [["softmax_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}